SuperInstance/quilt-esp32/sdkconfig.defaults
# sdkconfig.defaults — ESP-IDF defaults for the Quilt VM.
#
# Target: ESP32-S3 (preferred). Falls back to original ESP32.
# Wireless: WiFi station mode (required for ESP-NOW),
#           ESP-NOW enabled with Long Range support.
# Logging:  Info level for our tags, warn elsewhere.

# --- Target ---
CONFIG_IDF_TARGET="esp32s3"

# --- WiFi ---
CONFIG_WIFI_ENABLED=y
CONFIG_WIFI_STATIC_TX_BUFFER=y
CONFIG_WIFI_DYNAMIC_TX_BUFFER=y
CONFIG_WIFI_STATIC_RX_BUFFER=y
CONFIG_WIFI_DYNAMIC_RX_BUFFER=y

# --- ESP-NOW ---
CONFIG_ESP_NOW_ENABLED=y
CONFIG_ESP_NOW_MAX_DATA_NUM=10
CONFIG_ESP_NOW_MAX_TOTAL_PEER_NUM=16
CONFIG_ESP_NOW_LONG_RANGE=y

# --- FreeRTOS ---
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_TIMER_TASK_STACK_SIZE=4096

# --- Logging ---
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_MAXIMUM_LEVEL_INFO=y
CONFIG_LOG_COLORS=y

# --- Memory ---
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_HEAP_POISONING_DISABLED=y

# --- Watchdog ---
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10
CONFIG_ESP_MAIN_TASK_AFFINITY_CPU0=y

# --- Misc ---
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
